<?xml version="1.0"?>
<net name="main" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="data" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="squeezenet0_conv0_weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 3, 3" offset="0" size="6912" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv0_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv0_weight">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convolution_54" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_54" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Reshape_74" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="6912" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="squeezenet0_conv0_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_73, Reshape_74, squeezenet0_conv0_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv0_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="squeezenet0_relu0_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu0_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu0_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="squeezenet0_pool0_fwd" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_pool0_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>111</dim>
					<dim>111</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_pool0_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="squeezenet0_conv1_weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 64, 1, 1" offset="7168" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv1_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv1_weight">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convolution_105" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_105" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_125" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11264" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="squeezenet0_conv1_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_124, Reshape_125, squeezenet0_conv1_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv1_fwd">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="squeezenet0_relu1_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu1_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu1_fwd">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="squeezenet0_conv2_weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="11328" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv2_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv2_weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Convolution_154" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_154" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_174" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="15424" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="squeezenet0_conv2_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_173, Reshape_174, squeezenet0_conv2_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv2_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="squeezenet0_relu2_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu2_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu2_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="squeezenet0_conv3_weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 3, 3" offset="15680" size="36864" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv3_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv3_weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Convolution_203" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_203" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_223" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="52544" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="squeezenet0_conv3_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_222, Reshape_223, squeezenet0_conv3_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv3_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="squeezenet0_relu3_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu3_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu3_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="squeezenet0_concat0" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_concat0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_concat0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="squeezenet0_conv4_weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 128, 1, 1" offset="52800" size="8192" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv4_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv4_weight">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Convolution_253" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_253" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_273" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="60992" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="squeezenet0_conv4_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_272, Reshape_273, squeezenet0_conv4_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv4_fwd">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="squeezenet0_relu4_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu4_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu4_fwd">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="squeezenet0_conv5_weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 1, 1" offset="61056" size="4096" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv5_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv5_weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Convolution_302" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_302" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_322" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="65152" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="squeezenet0_conv5_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_321, Reshape_322, squeezenet0_conv5_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv5_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="squeezenet0_relu5_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu5_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu5_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="squeezenet0_conv6_weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 16, 3, 3" offset="65408" size="36864" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv6_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv6_weight">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convolution_351" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_351" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_371" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="102272" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="squeezenet0_conv6_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_370, Reshape_371, squeezenet0_conv6_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv6_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="squeezenet0_relu6_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu6_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu6_fwd">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="squeezenet0_concat1" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_concat1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_concat1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="squeezenet0_pool1_fwd" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_pool1_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_pool1_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="squeezenet0_conv7_weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 128, 1, 1" offset="102528" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv7_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv7_weight">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Convolution_403" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_403" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_423" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="118912" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="squeezenet0_conv7_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_422, Reshape_423, squeezenet0_conv7_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv7_fwd">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="squeezenet0_relu7_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu7_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu7_fwd">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="squeezenet0_conv8_weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="119040" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv8_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv8_weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Convolution_452" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_452" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_472" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="135424" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="squeezenet0_conv8_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_471, Reshape_472, squeezenet0_conv8_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv8_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="squeezenet0_relu8_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu8_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu8_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="squeezenet0_conv9_weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 3, 3" offset="135936" size="147456" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv9_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv9_weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Convolution_501" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_501" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_521" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="283392" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="squeezenet0_conv9_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_520, Reshape_521, squeezenet0_conv9_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv9_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="squeezenet0_relu9_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu9_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu9_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="squeezenet0_concat2" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_concat2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_concat2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="squeezenet0_conv10_weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 256, 1, 1" offset="283904" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv10_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv10_weight">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Convolution_551" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_551" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_571" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="316672" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="squeezenet0_conv10_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_570, Reshape_571, squeezenet0_conv10_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv10_fwd">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="squeezenet0_relu10_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu10_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu10_fwd">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="squeezenet0_conv11_weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="316800" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv11_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv11_weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Convolution_600" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_600" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_620" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="333184" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="squeezenet0_conv11_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_619, Reshape_620, squeezenet0_conv11_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv11_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="squeezenet0_relu11_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu11_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu11_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="squeezenet0_conv12_weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 3, 3" offset="333696" size="147456" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv12_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv12_weight">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Convolution_649" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_649" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_669" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="481152" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="squeezenet0_conv12_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_668, Reshape_669, squeezenet0_conv12_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv12_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="squeezenet0_relu12_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu12_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu12_fwd">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="squeezenet0_concat3" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_concat3" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_concat3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="squeezenet0_pool2_fwd" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_pool2_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>27</dim>
					<dim>27</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_pool2_fwd">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="squeezenet0_conv13_weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 256, 1, 1" offset="481664" size="49152" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv13_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv13_weight">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Convolution_701" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_701" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_721" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="530816" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="squeezenet0_conv13_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_720, Reshape_721, squeezenet0_conv13_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv13_fwd">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="squeezenet0_relu13_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu13_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu13_fwd">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="squeezenet0_conv14_weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 1, 1" offset="531008" size="36864" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv14_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv14_weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Convolution_750" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_750" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_770" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="567872" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="squeezenet0_conv14_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_769, Reshape_770, squeezenet0_conv14_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv14_fwd">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="squeezenet0_relu14_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu14_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu14_fwd">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="squeezenet0_conv15_weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 48, 3, 3" offset="568640" size="331776" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv15_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv15_weight">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Convolution_799" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_799" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Reshape_819" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="900416" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="squeezenet0_conv15_fwd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_818, Reshape_819, squeezenet0_conv15_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_conv15_fwd">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="squeezenet0_relu15_fwd" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_relu15_fwd" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="squeezenet0_relu15_fwd">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="squeezenet0_concat4" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_concat4" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="squeezenet0_concat4">
					<dim>1</dim>
					<dim>384</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="squeezenet0_conv16_weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 384, 1, 1" offset="901184" size="73728" />
			<rt_info>
				<attribute name="fused_names" version="0" value="squeezenet0_conv16_weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="squeezenet0_conv16_weight">
					<dim>48</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Convolution_849" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_849" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_869" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="974912" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="squeezenet0_conv16_fwd" type="Add" version="opset1">
